# num = 34
# age = 34.8
# name ="john DOE"
# is_student = True

# print(name.lower()) # уменьшиает регистр
# print(name.upper()) # увеличивает регистр
# print(name.capitalize() )# первая буква большая
# print(name.title()) # первая буква каждога слова большая
# print(name.replace('jhon','bob'))# заменает сторки 
# print(name *3)

# print (len(name))#длина строки

#   1234
# name ='Hasan'
# -5-4-3-2-1
# print(name(0))# H
# print(name(1))# A
# [ start:end :step]
# print(name[::-3])

# напишите праграмму которая принимает от пользователя слово
# и проверает его на палиндром если да то True , если нет False

# word = input('Enter a word:')
# print(word == word[::-1])

# num1= 10 
# num2 = [45,65,3]
# print (max(num1,num2))# сравнивает и выводит максимальное значение
# print (min(num1,num2))#сравнивает и выводит минимальное значение
# print(abs(-5))  # выводит модул числа
# print(sum(num2))

#  напишите программу которая принимает от пользавателя
# два слова и выводит сумму их длин

# неизменяемый
# num = 34
# age = 34.8
# name ="john DOE"
# is_student = True


#  сложные типы данных

# list -список
# ruits = ['яблока','банан','киви','арбуз',123,True, [12343,[234]],23.76]

# # tuple - кортеж ,неизменяемый тип данных
# passwords = ('123',132,'123','qwerrt1')

# # dict -словарь dictionary, key:value

#   #     key  :      value   
# car = {'color': 'red','price' :1000,'mileage':1200}

# # set - множество только уникалныйе значения
# emails = {'jhon@example.com','lane@example.com','bob@example.com',True,1}f

#           0         1      2       3
# fruits = 'яблока','банан','киви','арбуз'
# fruits = ['A','aaa', 'Aaa','BB','AA','bb','a']

# print(fruits[3]) [star:end:step]
# print(len(fruits))

# fruits. append('манго') # метод добавления в список
# fruits.insert(2,'манго')  # метод добавления в список по индексу 
# fruits. remove('банан') # метод удаления из списка
# fruits.reverse()# метод разворота списка
# fruits. sort() #метод сортировки списка
# print(fruits)



# напишите праграмму,которая запрашивает у
# пользователя число и сохраняет их списке
# затем выведите сумму всех чисел,их среднее
# значение и наибольшее и наименьше число в списке.


numbers = [23,5,56]
num = int(input('entr num'))

# создайте праграмму для удаления 
# дубликатов из списка.запросите у
list_1 = [1,2,3,4,5,1,2,3,4,5,6]#    подсказка int('23')



# пользавателя список с повторяющимися элеметами и 
# затем удалите все дубликаты , оставив толко уникалные элеметы


