# цикл for

# for переменная in объкт итерации:
#      действие с переменной 

# name = 'jhon'

# for  letter in name :
#     print(letter+'ahahaha')


# fruits = ['apples','banans', 'oranqes']

# for fruit in fruits:
#     print(f'i like { fruit}')


# nums = [1,2,3,4,5]

# for num in nums :
#     print(num+5)

# генертор чисел
# for num in range(1,10+1):# (start, end , step)
#     print(num*3)
        

# for i in range(1, 21):
#      if i % 2 == 0 :
#           print(i)

# students = {'jhon':18, 'sara': 22, 'bob': 23 }
# stub_list = [('jhon': 18), ('sara': 22) ]

# for i,x in students. items():
    # print(i,x)

# for i in range(5):
#     print(i)
# else:
#     print('Done')


# # оператор break
# for i in range (6):
#     print(i)
#     if i == 6: 
#         break # принудительно завершает цикил 
# else:
#     print('Done')    


# for i in range (20):
#     if i >=3 and i <=7: 
#         continue # пропускает 3
#     print(i)
# else:
#     print('Done')    
  
# n = range (23)
# print(n)

# movies = ['ttrmeneator ','alen','predator']

# print('my top 3 movies')
# for index, movie in  enumerate(movies,start=1):
#     print(f'{index}, \n {movie}')

# print(movie)


# movie = 'termin'
# print(movie)
# movie = 'alen'
# print(movie)
# movie = 'predator'
# print(movie)


# print(movie)

# цикл while

# while  условие
    #   блок кода 

# count = 0 

# while count <=5:
#     # print(count)
#     count = count + 1 
   

# num = -1

# while num <= 0:
#     num = int( input('enter num'))
#     print(num)



# count = 0 

# while count <= 5:
#     print(count)
#     count =  + 1 # count = count + 1 тоже самое 
#     if count == 3: 
#       break



# напишите программу которая будет давать возможность угадать парол 

# password = 'qwerty123'
# word = None

# while password != word:
#     word = input("enter pass: ")
#     print(word)


# for _ in range(10):
#     print('hello')

# name = _ 

# print(name)


# num = 0 

# while True:
#     num +=1
#     print(num)

# flag =True

# while flag:
#     name = input('enter name:')
#     if name =='stop':
#         flag = False
#         print(name)    
# else:
#     print("iterble is over")        


# from random import randint


# random_num = randint(1,100)
# guess = None

# while guess != random_num:
#     guess = int(input("угадайте число от 1 до 100:" ))
#     if guess < random_num:
#         print("загаданное число больше ")
#     elif guess > random_num:
#         print("загаданное число меньше")
#     else:
#         print('хорооош  угадал,респект, это потому что ментер крутой')        

# songs = ['pop- rock','rap','rock',
#          'cuntry', 'jazz', 'etno',
#          'fonk','pop','edm','indi','opera','hip-hop',
#          'trap','rnd','classic','shanson','bloos','punk-rock',
#          'metal','electro','remix','mash up ','covers']

# random_num = randint(0,23)
# print(songs[random_num])


# Напишите программу, которая продолжает запрашивать у 
# пользователя числа и суммирует их, пока пользователь не введет 0.

# Напишите программу, которая выполняет обратный отсчет от 10 до 1 и 
# затем выводит "Старт!"

# Напишите программу, которая подсчитывает количество 
# гласных букв в строке. 
words = 'hello world,I LOVE METALLL EYAAAAAAAAA'

# Напишите программу которая находит факториал числа.
num = 5

# Напишите программу которая вывод таблицу умнежения для чисел от 1 до 9

 
# summa = 0
# num = None


# # while num != 0:
#     num = int(input('enter num:' ))
#     summa += num
#     print(summa)

 
# while 5>10:
#     pass

# print('hello')





